import streamlit as st

def experience_page():
    st.markdown("## 个人经历")
    
    # 德勤咨询实习
    st.markdown("""
    **德勤管理咨询（上海）有限公司 | 数字化咨询实习生**  
    **📅 2023.12 - 2024.06**

    •	客户公司/业务：为某豪华汽车品牌以及某光伏设备公司建立CRM系统，完成数字化转型。

    •	项目规划：协助完成6个项目建议书，总计450页，包括汽车行业数字营销和转换能力的关键指标和绩效指标。
   
    •	功能设计：了解客户需求并根据系统标准化功能进行调整。使用 Visio和PPT 协助制作近 40 个业务流程图，梳理并优化了从客户留存到交付新车的8个核心流程和3个管控视角的业务流程，帮助线索机会转化率提升了20%。
  
    •	系统测试：协助系统集成和测试，撰写测试用例，编写5个用户操作手册（共100页），促进系统迭代。
   
    •	数据分析：功能上线后，利用CRM关键绩效指标制作每周报告并构建数据看板，对关键绩效指标的趋势和差异提供相关见解，从数据分析的角度推动营销决策。报告帮助团队推动了市场活动的实施，使大订数量平均增加了 30%。
    """)
    
    # 益普索实习
    st.markdown("""
    **益普索（中国）咨询有限公司上海分公司 | 定量研究实习生**  
    **📅 2023.03 - 2023.05** 

    •	客户公司/业务：通过市场研究为某个护品牌以及某啤酒品牌进行咨询服务
    
    •	数据分析：整理行业数据并用Excel分析整理输出结论，分析品牌的市场定位及营销策略、目标客户群等。
    
    •	市场调研：搭建项目前期框架，制作PPT并分析其数据趋势走向的市场深层原因并输出结论，提供品牌营销策略。
    
    •	后期跟进：整理产品市场调研结果数据并进行核查，整理会议记录，针对品牌方所提出的反馈进行PPT修改。
    """)
    
    st.markdown("---")
    st.markdown("## 活动&竞赛经历")
    st.markdown("""
    **Nano Detect 新污染物单分子检测 —— 国产环境监测装备开拓者 | 团队成员**  
    **📅 2021.05 - 2022.09**

    •	市场调研：进行PEST分析、SWOT分析，分析设备市场的上下游市场趋势，预估市场份额与市场竞争情况。
    
    •	数据处理：负责数据收集、清洗工作，利用SQL和Excel进行数据整合与筛选，完成数据分析，撰写商业计划书。
    
    •	项目成果：研发出便携式全氟检测设备，完善其硬件结构与软件模块，并帮助项目组与企业达成合作投放使用。
    
    •	竞赛奖项：第七届中国国际“互联网+”大学生创新创业大赛上海赛区金奖、全国铜奖；第八届中国国际“互联网+”大学生创新创业大赛校级特等奖、上海市银奖；第十三届“挑战杯”中国大学生创业计划大赛上海赛区银奖；
    """)